# PANDAS COMPLETE TUTORIAL

## CH01_INTRODUCTION

In [1]:
intro="""
Pandas is a Python library used for working with data sets.

Pandas is an open-source Python Library providing high-performance data manipulation and 
analysis tool using its powerful data structures

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and
was created by Wes McKinney in 2008.

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

Pandas gives you answers about the data. Like:

Is there a correlation between two or more columns?
What is average value?
Max value?
Min value?

Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or 
NULL values. This is called cleaning the data.

The source code for Pandas is located at this github repository https://github.com/pandas-dev/pandas

Pandas provides two types of classes for handling data:

Series: a one-dimensional labeled array holding data of any type
such as integers, strings, Python objects etc.

DataFrame: a two-dimensional data structure that holds data like a two-dimension array or 
a table with rows and columns.
"""

In [ ]:
#FEATURES 
"""
Fast and efficient DataFrame object with default and customized indexing.
Tools for loading data into in-memory data objects from different file formats.
Data alignment and integrated handling of missing data.
Reshaping and pivoting of date sets.
Label-based slicing, indexing and subsetting of large data sets.
Columns from a data structure can be deleted or inserted.
Group by data for aggregation and transformations.
High performance merging and joining of data.
Time Series functionality.

To install pandas 

pip install pandas

#to import 
import pandas 
or 
import pandas as pd (universal format)
"""

## CH02 WORKING WITH PANDAS SERIES

In [7]:
#WORKIGN WITH SERIES

l1=[21,22,23,24,25,65,43]

import pandas as pd 

ser=pd.Series(l1)
print("the pandas series is ")
print(ser)
print("the series type is = ",type(ser))

the pandas series is
0    21
1    22
2    23
3    24
4    25
5    65
6    43
dtype: int64
the series type is =  <class 'pandas.core.series.Series'>

In [8]:
#creating another series 

numbers=[25,76,45,34,45]
index=['a','b','c','d','e']
ser=pd.Series(numbers,index=index)
print(ser)

a    25
b    76
c    45
d    34
e    45
dtype: int64

In [ ]:
"""
Attributes and Methods:
series.values: Returns the values of the Series as a NumPy array.
series.index: Returns the index of the Series.
series.dtype: Returns the data type of the values.
series.head(n): Returns the first n elements.
series.tail(n): Returns the last n elements.
series.describe(): Generates descriptive statistics.
"""

In [14]:

numbers=[25,76,45,34,45,55,67,89,56,43]
index=['a','b','c','d','e','f','g','h','i','j']
ser=pd.Series(numbers,index=index)

print("data series are = ",ser.values)
print("data index are = ",ser.index)
print("data type is = ",ser.dtype)

data series are =  [25 76 45 34 45 55 67 89 56 43]
data index are =  Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')
data type is =  int64

In [15]:
ser.head(3)

a    25
b    76
c    45
dtype: int64

In [16]:
ser.head() #it will show first 5 records

a    25
b    76
c    45
d    34
e    45
dtype: int64

In [17]:
n=3
ser.tail(n)

h    89
i    56
j    43
dtype: int64

In [18]:
ser.tail() #it will show last 5 records

f    55
g    67
h    89
i    56
j    43
dtype: int64

In [19]:
ser.describe() $decribes about data set

count    10.000000
mean     53.500000
std      19.449364
min      25.000000
25%      43.500000
50%      50.000000
75%      64.250000
max      89.000000
dtype: float64

In [ ]:
#working with slicing and indexing on pandas series

In [30]:
import pandas as pd 
numbers=[25,76,45,34,45,55,67,89,56,43,55,67,89,]
index=['a','b','c','d','e','f','g','h','i','j',"k","l","m"]

ser=pd.Series(numbers,index=index)

#integer based slicing 
#print("the pandas series are = ",ser)
print("the 0th element is = ",ser[0])

print("the last element is = ",ser[len(ser)-1])
print("the last element is = ",ser[-1])
print("the last element is = ",ser[12])

#Label-based Indexing:
print("the 0th element is = ",ser['a'])
print("the last element is = ",ser['m'])
print("the second element is = ",ser['b'])

the 0th element is =  25
the last element is =  89
the last element is =  89
the last element is =  89
the 0th element is =  25
the last element is =  89
the second element is =  76

In [36]:
#slicing series[start:stop:step]
print(ser["a":"d"]) #d include and default step is 1
print(ser[0:3]) #3 exclude and default step is 1

a    25
b    76
c    45
d    34
dtype: int64
a    25
b    76
c    45
dtype: int64

In [37]:
print(ser["a":"d":2]) #d include and step is 2
print(ser[0:3:2]) #3 exclude and step is 1

a    25
c    45
dtype: int64
a    25
c    45
dtype: int64

In [39]:
#boolean indexing 
bool_data=ser>=50 #it will create boolean series
print(bool_data)
print(ser[bool_data]) #it prints value more or equl to 50

a    False
b     True
c    False
d    False
e    False
f     True
g     True
h     True
i     True
j    False
k     True
l     True
m     True
dtype: bool
b    76
f    55
g    67
h    89
i    56
k    55
l    67
m    89
dtype: int64

In [40]:
print(ser[ser>70])

b    76
h    89
m    89
dtype: int64

In [41]:
#fancy indexing 
print(ser[["a","c","d","e"]])

a    25
c    45
d    34
e    45
dtype: int64

In [43]:
#fancy indexing 
print(ser[['m',"a","c","d","e",'e','e']])

m    89
a    25
c    45
d    34
e    45
e    45
e    45
dtype: int64

In [48]:
# Indexing with iloc and loc:
import pandas as pd 
numbers=[25,76,45,34,45,55,67,89,56,43,55,67,89,]
index=['a','b','c','d','e','f','g','h','i','j',"k","l","m"]

data_ser=pd.Series(numbers,index=index)
print("0th value is =",data_ser.iloc[0]) #implicit index
print("0th value is =",data_ser.loc['a'])#explicit index

print("last value is =",data_ser.iloc[12])
print("last value is =",data_ser.loc['m'])

0th value is = 25
0th value is = 25
last value is = 89
last value is = 89

In [52]:
#Setting and Resetting Index:

import pandas as pd 
numbers=[25,76,45,34,45,55,67,89,56,43,55,67,89,]
index=['a','b','c','d','e','f','g','h','i','j',"k","l","m"]

s=pd.Series(numbers,index=index)
print(s)
s.reset_index(drop=True, inplace=True) #resetting the index 
print(s)

a    25
b    76
c    45
d    34
e    45
f    55
g    67
h    89
i    56
j    43
k    55
l    67
m    89
dtype: int64
0     25
1     76
2     45
3     34
4     45
5     55
6     67
7     89
8     56
9     43
10    55
11    67
12    89
dtype: int64

In [60]:
#arithmatic operations on pandas series 
import pandas as pd

series1 = pd.Series([4, 13, 20, 16])
series2 = pd.Series([5, 6, 7, 8])

# Addition
result = series1 + series2
print("the addition result\n",result)

# Subtraction
result = series1 - series2
print("the subtraction result\n",result)
# Multiplication
result = series1 * series2
print("the multiplication result\n",result)

# Division
result = series1 / series2
print("the division result\n",result)

# floor Division
result = series1 // series2
print("the floor division result\n",result)

the addition result
 0     9
1    19
2    27
3    24
dtype: int64
the subtraction result
 0    -1
1     7
2    13
3     8
dtype: int64
the multiplication result
 0     20
1     78
2    140
3    128
dtype: int64
the division result
 0    0.800000
1    2.166667
2    2.857143
3    2.000000
dtype: float64
the floor division result
 0    0
1    2
2    2
3    2
dtype: int64

In [61]:
# floor Division
result = series1 % series2
print("the modulation result\n",result)

the modulation result
 0    4
1    1
2    6
3    0
dtype: int64

In [62]:
# exponential result
result = series1 ** series2
print("the floor division result\n",result)

the floor division result
 0          1024
1       4826809
2    1280000000
3    4294967296
dtype: int64

In [68]:
#aggregate function 
#mean(), median(), std(), sum(), min(), max()
import pandas as pd

series = pd.Series([2, 8, 16, 4])
# Sum
total = series.sum()
print("the total of the series = ",total)
# Mean
average = series.mean()
print("the avg of the series = ",average)
# Maximum
maximum_value = series.max()
print("the maximum value of the series = ",maximum_value)
# Minimum
minimum_value = series.min()
print("the min value of the series = ",minimum_value)

# Median
median_value = series.median()
print("the median value of the series = ",median_value)

# std
std_value = series.std()
print("the std value of the series = ",std_value)

the total of the series =  30
the avg of the series =  7.5
the maximum value of the series =  16
the min value of the series =  2
the min value of the series =  6.0
the min value of the series =  6.191391873668904

In [71]:
"""
Handling Missing Data:
find series.isnull() to find null values 
Methods like series.dropna() and series.fillna(value) are used to handle missing data.
"""
import numpy as np 
import pandas as pd 

data=pd.Series([21,23,55,67,np.nan,99,23,np.nan,np.nan])
print(data)

new_data=data.dropna()
print(new_data)

new_data=data.fillna(data.max())
print(new_data)

0    21.0
1    23.0
2    55.0
3    67.0
4     NaN
5    99.0
6    23.0
7     NaN
8     NaN
dtype: float64
0    21.0
1    23.0
2    55.0
3    67.0
5    99.0
6    23.0
dtype: float64
0    21.0
1    23.0
2    55.0
3    67.0
4    99.0
5    99.0
6    23.0
7    99.0
8    99.0
dtype: float64

In [72]:

new_data=data.fillna(22)
print(new_data)

0    21.0
1    23.0
2    55.0
3    67.0
4    22.0
5    99.0
6    23.0
7    22.0
8    22.0
dtype: float64

In [9]:
import pandas as pd
# Create a DataFrame with missing values
data = [1, 2, None, 4]
df = pd.Series(data)
print(df)

# Identify missing values
print(df.isnull())

print(df[df.isnull()])

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64
0    False
1    False
2     True
3    False
dtype: bool
2   NaN
dtype: float64

In [11]:
##working with sortings 
import pandas as pd

s = pd.Series([3, 1, 2], index=['c', 'a', 'b'])
print("the series is \n",s)
sorted_by_index = s.sort_index()
print("the series with sorting is \n",sorted_by_index)

the series is
 c    3
a    1
b    2
dtype: int64
the series with sorting is
 a    1
b    2
c    3
dtype: int64

In [12]:
sorted_descending = s.sort_index(ascending=False)
print(sorted_descending)

c    3
b    2
a    1
dtype: int64

In [13]:
sorted_by_values = s.sort_values()
print(sorted_by_values)

a    1
b    2
c    3
dtype: int64

In [14]:
sorted_by_values = s.sort_values(ascending=False)
print(sorted_by_values)

c    3
b    2
a    1
dtype: int64

In [15]:
s_with_nan = pd.Series([3, 1, np.nan, 2], index=['c', 'a', 'd', 'b'])
sorted_with_nan = s_with_nan.sort_index()
print(sorted_with_nan)

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [19]:
sorted_nan_first = s_with_nan.sort_values(na_position='first')
sorted_nan_first

d    NaN
a    1.0
b    2.0
c    3.0
dtype: float64

In [20]:
sorted_nan_first = s_with_nan.sort_values(na_position='last')
sorted_nan_first

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [24]:
#rank and Unique Values and Value Counts:
import pandas as pd

# Create a sample Series
data = pd.Series([10, 20, 15, 25, 20], name='A')

# Apply rank() to the Series
#now data arrange in ascending order here [10,15,20,20,25] nad rank is [1,2,3,5] now appiled to  matrix [1,3.5,2,5,3.5]
#three is 2 places so divided 
ranked_series = data.rank()

# Display the original Series and the ranked Series
print("Original Series:")
print(data)

print("\nRanked Series:")
print(ranked_series)

Original Series:
0    10
1    20
2    15
3    25
4    20
Name: A, dtype: int64

Ranked Series:
0    1.0
1    3.5
2    2.0
3    5.0
4    3.5
Name: A, dtype: float64

In [25]:
import pandas as pd 
s=pd.Series([21,21,34,35,35,67,35,23,46,45,46,46])
print(s)
unique_values = s.unique() #getting the unique values from series 
print(unique_values)
value_counts = s.value_counts() #getiing numbers of times values present in series
print(value_counts)

0     21
1     21
2     34
3     35
4     35
5     67
6     35
7     23
8     46
9     45
10    46
11    46
dtype: int64
[21 34 35 67 23 46 45]
35    3
46    3
21    2
34    1
67    1
23    1
45    1
Name: count, dtype: int64

In [26]:
"""
cumulative operation on pandas series 
series.cumsum(), series.cumprod(), series.cummax(), and series.cummin()
 
"""
import pandas as pd

# Create a sample Series
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

# Calculate cumulative sum
cumulative_sum = series.cumsum()
print(cumulative_sum)

0     1
1     3
2     6
3    10
4    15
dtype: int64

In [27]:
import pandas as pd

# Create a sample Series
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

# Calculate cumulative product
cumulative_product = series.cumprod()
print(cumulative_product)

0      1
1      2
2      6
3     24
4    120
dtype: int64

In [28]:
import pandas as pd

# Create a sample Series
data = [1, 4, 2, 7, 3]
series = pd.Series(data)

# Calculate cumulative maximum
cumulative_max = series.cummax()
print(cumulative_max)

0    1
1    4
2    4
3    7
4    7
dtype: int64

In [29]:
import pandas as pd

# Create a sample Series
data = [5, 3, 8, 2, 6]
series = pd.Series(data)

# Calculate cumulative minimum
cumulative_min = series.cummin()
print(cumulative_min)

0    5
1    3
2    3
3    2
4    2
dtype: int64

In [31]:
#cumalative process of count particular event 
import pandas as pd

# Create a sample Series
data = ['A', 'B', 'A', 'C', 'A', 'A', 'B', 'A']

series = pd.Series(data)

# Calculate cumulative count
cumulative_count = series.groupby(series).cumcount() + 1
print(cumulative_count)

#print
# Print the count of each unique element
unique_counts = series.value_counts()
print(unique_counts)

0    1
1    1
2    2
3    1
4    3
5    4
6    2
7    5
dtype: int64
A    5
B    2
C    1
Name: count, dtype: int64

### string operations on pandas series

In [55]:
"""
series.str.cat(s2,sep=" ")
series.str.len()
series.str.upper()
series.str.lower()
series.str.contains('an') #returns boolean array
s.str.slice(0, 2)
str.extract()
s.str.replace('a', 'X')
s.str.strip()
s.str.split()
s.str.count('a')
s.str.startswith('a') #return boolean array
s.str.endsswith('a') #return with boolean array 
s.str.title()

"""

import pandas as pd

# Creating two Series
s1 = pd.Series(['hello', 'world'])
s2 = pd.Series(['welcome', 'Pandas'])

# Concatenation using +
result = s1 + s2
print(result)

# Concatenation using .str.cat()
result_cat = s1.str.cat(s2, sep=' ')
print(result_cat)

0    hellowelcome
1     worldPandas
dtype: object
0    hello welcome
1     world Pandas
dtype: object

In [35]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# String length
length = s.str.len()
print(length)

0    5
1    6
2    6
dtype: int64

In [36]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Uppercase
uppercase = s.str.upper()
print(uppercase)

# Lowercase
lowercase = s.str.lower()
print(lowercase)

0     APPLE
1    BANANA
2    CHERRY
dtype: object
0     apple
1    banana
2    cherry
dtype: object

In [45]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Check if 'an' is present in each string
contains_an = s.str.contains('an')
print(contains_an)

0    False
1     True
2    False
dtype: bool

In [41]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Extract the first two characters
extracted = s.str.slice(0, 2)
print(extracted)

0    ap
1    ba
2    ch
dtype: object

In [42]:
#date and time arrangements 
import pandas as pd

# Creating a Series with date strings
date_series = pd.Series(['01-05-2022', '15-09-2023', '28-12-2024'])

# Using .str.extract() with a regular expression to extract day, month, and year
date_extracted = date_series.str.extract(r'(?P<Day>\d{2})-(?P<Month>\d{2})-(?P<Year>\d{4})')

# Displaying the result
print(date_extracted)

  Day Month  Year
0  01    05  2022
1  15    09  2023
2  28    12  2024

In [44]:
#replace 
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Replace 'a' with 'X'
replaced = s.str.replace('a', 'X')
print(replaced)

0     Xpple
1    bXnXnX
2    cherry
dtype: object

In [50]:
#strip white space 
import pandas as pd

s = pd.Series(['  apple  ', ' banana ', '            cherry        '])

# Strip whitespace
stripped = s.str.strip()
print(stripped)

0     apple
1    banana
2    cherry
dtype: object

In [51]:
import pandas as pd

s = pd.Series(['apple orange', 'banana grape', 'cherry lemon'])

# Split each string
split_result = s.str.split()
print(split_result)

0    [apple, orange]
1    [banana, grape]
2    [cherry, lemon]
dtype: object

In [52]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Count occurrences of 'a'
count_a = s.str.count('a')
print(count_a)

0    1
1    3
2    0
dtype: int64

In [53]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Check if each string starts with 'a'
starts_with_a = s.str.startswith('a')
print(starts_with_a)

# Check if each string ends with 'y'
ends_with_y = s.str.endswith('y')
print(ends_with_y)

0     True
1    False
2    False
dtype: bool
0    False
1    False
2     True
dtype: bool

In [54]:
import pandas as pd

s = pd.Series(['apple pie', 'banana split', 'cherry tart'])

# Convert to title case
title_case = s.str.title()
print(title_case)

0       Apple Pie
1    Banana Split
2     Cherry Tart
dtype: object

In [56]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Replace using a dictionary
replace_dict = {'apple': 'orange', 'banana': 'grape'}
replaced = s.replace(replace_dict)
print(replaced)

0    orange
1     grape
2    cherry
dtype: object

In [60]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Join strings with comma
joined = ','.join(s)
print(joined)

joined = '-'.join(s)
print(joined)

joined = ' '.join(s)
print(joined)

joined = '+'.join(s)
print(joined)

apple,banana,cherry
apple-banana-cherry
apple banana cherry
apple+banana+cherry

In [61]:
import pandas as pd

s = pd.Series(['123', 'abc', '456def'])

# Check if each string is numeric
is_numeric = s.str.isnumeric()
print(is_numeric)

# Check if each string is alphabetic
is_alpha = s.str.isalpha()
print(is_alpha)

0     True
1    False
2    False
dtype: bool
0    False
1     True
2    False
dtype: bool

In [62]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Pad each string with '-' to a width of 10
padded = s.str.pad(width=10, side='right', fillchar='-')
print(padded)

0    apple-----
1    banana----
2    cherry----
dtype: object

In [63]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry123'])

# Check if each string contains a digit
contains_digit = s.str.contains(r'\d')
print(contains_digit)

# Extract numeric part from each string
numeric_part = s.str.extract(r'(\d+)')
print(numeric_part)

0    False
1    False
2     True
dtype: bool
     0
0  NaN
1  NaN
2  123

In [64]:
import pandas as pd

s = pd.Series(['apple', '', 'cherry', None])

# Check for null values
is_null = s.isnull()
print(is_null)

# Check for empty strings
is_empty = s.str.isspace()
print(is_empty)

0    False
1    False
2    False
3     True
dtype: bool
0    False
1    False
2    False
3     None
dtype: object

In [65]:
import pandas as pd

s = pd.Series(['apple', 'banana', 'cherry'])

# Left align strings to a width of 10
left_aligned = s.str.ljust(10)
print(left_aligned)

# Right align strings to a width of 10
right_aligned = s.str.rjust(10)
print(right_aligned)

# Center align strings to a width of 10
center_aligned = s.str.center(10)
print(center_aligned)

0    apple
1    banana
2    cherry
dtype: object
0         apple
1        banana
2        cherry
dtype: object
0      apple
1      banana
2      cherry
dtype: object

### datetime series

In [69]:
import pandas as pd

dates = pd.to_datetime(['2022-01-01', '2022-01-02', '2022-01-03'])
series = pd.Series([1, 2, 3], index=dates)
series

2022-01-01    1
2022-01-02    2
2022-01-03    3
dtype: int64

In [70]:
import pandas as pd

# Creating a Datetime Series
date_rng = pd.date_range(start='2022-01-01', end='2022-01-05', freq='D')
series = pd.Series([1, 2, 3, 4, 5], index=date_rng)
print("Original Series:")
print(series)

Original Series:
2022-01-01    1
2022-01-02    2
2022-01-03    3
2022-01-04    4
2022-01-05    5
Freq: D, dtype: int64

In [71]:
# Slicing by Datetime Range
subset = series['2022-01-02':'2022-01-04']
print("Subset of Series:")
print(subset)

Subset of Series:
2022-01-02    2
2022-01-03    3
2022-01-04    4
Freq: D, dtype: int64

In [73]:
# Resampling: Upsample to hourly frequency, forward fill missing values
upsampled_series = series.resample('H').fillna(method='pad')
print("Upsampled Series:")
print(upsampled_series)

Upsampled Series:
2022-01-01 00:00:00    1
2022-01-01 01:00:00    1
2022-01-01 02:00:00    1
2022-01-01 03:00:00    1
2022-01-01 04:00:00    1
                      ..
2022-01-04 20:00:00    4
2022-01-04 21:00:00    4
2022-01-04 22:00:00    4
2022-01-04 23:00:00    4
2022-01-05 00:00:00    5
Freq: H, Length: 97, dtype: int64

C:\Users\admin\AppData\Local\Temp\ipykernel_15588\2104790716.py:2: FutureWarning: DatetimeIndexResampler.fillna is deprecated and will be removed in a future version. Use obj.ffill(), obj.bfill(), or obj.nearest() instead.
  upsampled_series = series.resample('H').fillna(method='pad')

In [74]:
# Resampling: Downsample to daily frequency, summing values
downsampled_series = series.resample('D').sum()
print("Downsampled Series:")
print(downsampled_series)

Downsampled Series:
2022-01-01    1
2022-01-02    2
2022-01-03    3
2022-01-04    4
2022-01-05    5
Freq: D, dtype: int64

In [75]:
# Time Shifting: Shift the entire series by 1 time step
shifted_series = series.shift(1)
print("Shifted Series:")
print(shifted_series)

Shifted Series:
2022-01-01    NaN
2022-01-02    1.0
2022-01-03    2.0
2022-01-04    3.0
2022-01-05    4.0
Freq: D, dtype: float64

In [76]:
# Rolling Windows: Calculate the rolling mean with a window size of 3
rolling_mean = series.rolling(window=3).mean()
print("Rolling Mean:")
print(rolling_mean)

Rolling Mean:
2022-01-01    NaN
2022-01-02    NaN
2022-01-03    2.0
2022-01-04    3.0
2022-01-05    4.0
Freq: D, dtype: float64

In [77]:
# Time-based Indexing: Select values within a specific date range
selected_range = series['2022-01-02':'2022-01-04']
print("Selected Range:")
print(selected_range)

Selected Range:
2022-01-02    2
2022-01-03    3
2022-01-04    4
Freq: D, dtype: int64

In [78]:
# Handling Time Zones: Convert time zone
series_utc = series.tz_localize('UTC')
series_est = series_utc.tz_convert('US/Eastern')
print("Time Zone Conversion:")
print(series_est)

Time Zone Conversion:
2021-12-31 19:00:00-05:00    1
2022-01-01 19:00:00-05:00    2
2022-01-02 19:00:00-05:00    3
2022-01-03 19:00:00-05:00    4
2022-01-04 19:00:00-05:00    5
Freq: D, dtype: int64

In [79]:
# Frequency Conversion: Change frequency to hourly, forward fill missing values
freq_converted_series = series.asfreq('H', method='pad')
print("Frequency Converted Series:")
print(freq_converted_series)

Frequency Converted Series:
2022-01-01 00:00:00    1
2022-01-01 01:00:00    1
2022-01-01 02:00:00    1
2022-01-01 03:00:00    1
2022-01-01 04:00:00    1
                      ..
2022-01-04 20:00:00    4
2022-01-04 21:00:00    4
2022-01-04 22:00:00    4
2022-01-04 23:00:00    4
2022-01-05 00:00:00    5
Freq: H, Length: 97, dtype: int64

In [80]:
# Date Components: Extract the year from the datetime index
year_component = series.index.year
print("Year Component:")
print(year_component)

Year Component:
Index([2022, 2022, 2022, 2022, 2022], dtype='int32')

In [81]:
# Resampling and Aggregating with Custom Functions
def custom_function(x):
    return x.max() - x.min()

custom_resampled_series = series.resample('W').apply(custom_function)
print("Custom Resampled Series:")
print(custom_resampled_series)

Custom Resampled Series:
2022-01-02    1
2022-01-09    2
Freq: W-SUN, dtype: int64

### handling duplicates in pandas series

In [83]:
import pandas as pd

# Sample Series with duplicates
data = pd.Series([1, 2, 2, 3, 4, 4, 5])

# Check for duplicates
duplicates = data.duplicated()
print(duplicates)

print(data[duplicates])

0    False
1    False
2     True
3    False
4    False
5     True
6    False
dtype: bool
2    2
5    4
dtype: int64

In [84]:
# Remove duplicates
unique_data = data.drop_duplicates()
print(unique_data)

0    1
1    2
3    3
4    4
6    5
dtype: int64

In [85]:
# Count duplicates
duplicate_counts = data.value_counts()
duplicates = duplicate_counts[duplicate_counts > 1]
print(duplicates)

2    2
4    2
Name: count, dtype: int64

In [87]:
# Sample Series with custom index
data = pd.Series([1, 2, 2, 3, 4, 4, 5], index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

# Check for duplicates including the first occurrence
duplicates = data.duplicated(keep=False)
print(duplicates)

data[duplicates]

a    False
b     True
c     True
d    False
e     True
f     True
g    False
dtype: bool

b    2
c    2
e    4
f    4
dtype: int64

In [88]:
# Sample Series
data = pd.Series([1, 2, 2, 3, 4, 4, 5])

# Keep only duplicates
duplicates_only = data[data.duplicated(keep=False)]
print(duplicates_only)

1    2
2    2
4    4
5    4
dtype: int64

In [89]:
# Sample Series
data = pd.Series([1, 2, 2, 3, 4, 4, 5])

# Rename duplicates
renamed_data = data.astype(str) + data.groupby(data).cumcount().astype(str)
print(renamed_data)

0    10
1    20
2    21
3    30
4    40
5    41
6    50
dtype: object

In [90]:
# Sample Series with duplicates
data = pd.Series([1, 2, 2, 3, 4, 4, 5,None])

# Remove duplicates and handle missing values
unique_data = data.drop_duplicates().dropna()
print(unique_data)

0    1.0
1    2.0
3    3.0
4    4.0
6    5.0
dtype: float64

In [91]:
# Sample Series
data = pd.Series([1, 2, 2, 3, 4, 4, 5])

# Mark duplicates with a flag
data['is_duplicate'] = data.duplicated(keep=False)
print(data)

0                                                               1
1                                                               2
2                                                               2
3                                                               3
4                                                               4
5                                                               4
6                                                               5
is_duplicate    0    False
1     True
2     True
3    False
4 ...
dtype: object

## CH03 WORKING WITH PANDAS DATA FRAMES

In [92]:
"""
A DataFrame is a two-dimensional, labeled data structure with columns that can be of different types. 
It's like a spreadsheet or SQL table, where you can store and manipulate data easily.
"""
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [93]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [94]:
#reading datas from files  and writing to files 
#files i kept in datas folder 

import pandas as pd

df = pd.read_csv('datas/diabetes.csv')
df.head()

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

In [95]:
#writing files to files 
#i will write in datas folder 

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)

# Write to CSV
df.to_csv('datas/sample_write_01.csv', index=False)

In [96]:
#read sql data in pandas dataframes 
#before that i create sql for create record 

import sqlite3

# Connect to SQLite database (this will create a new database file if it doesn't exist)
conn = sqlite3.connect('datas/sample_01.db')

# Create a cursor object to execute SQL queries
cursor = conn.cursor()

# Define the SQL query to create a table
create_table_query = '''
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT
);
'''

# Execute the query to create the table
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

In [97]:
# Insert data into the 'students' table
insert_data_query = '''
INSERT INTO students (name, age, grade) VALUES
('Alice', 25, 'A'),
('Bob', 22, 'B'),
('Charlie', 28, 'C');
'''

# Execute the query to insert data
cursor.execute(insert_data_query)

# Commit the changes
conn.commit()

In [98]:
# Query data from the 'students' table
select_data_query = 'SELECT * FROM students'

# Execute the query and fetch the results into a Pandas DataFrame
import pandas as pd

df = pd.read_sql(select_data_query, conn)

# Display the DataFrame
print(df)

   id     name  age grade
0   1    Alice   25     A
1   2      Bob   22     B
2   3  Charlie   28     C

In [99]:
df

   id     name  age grade
0   1    Alice   25     A
1   2      Bob   22     B
2   3  Charlie   28     C

In [100]:
insert_data_query = '''
INSERT INTO students (name, age, grade) VALUES
('govind', 34, 'A'),
('kavitha', 32, 'B'),
('parthiban', 38, 'C');
'''

# Execute the query to insert data
cursor.execute(insert_data_query)

# Commit the changes
conn.commit()

In [101]:
# Query data from the 'students' table
select_data_query = 'SELECT * FROM students'

# Execute the query and fetch the results into a Pandas DataFrame
import pandas as pd

df = pd.read_sql(select_data_query, conn)

# Display the DataFrame
print(df)

   id       name  age grade
0   1      Alice   25     A
1   2        Bob   22     B
2   3    Charlie   28     C
3   4     govind   34     A
4   5    kavitha   32     B
5   6  parthiban   38     C

In [102]:
df

   id       name  age grade
0   1      Alice   25     A
1   2        Bob   22     B
2   3    Charlie   28     C
3   4     govind   34     A
4   5    kavitha   32     B
5   6  parthiban   38     C

In [103]:
# Close the database connection
conn.close()

### Accessing datas

In [105]:
#reading datas from files  and writing to files 
import pandas as pd

df = pd.read_csv('datas/diabetes.csv')
df.head()

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

In [106]:
# Accessing datas 
age_column = df['Age']
age_column

0      50
1      31
2      32
3      21
4      33
       ..
763    63
764    27
765    30
766    47
767    23
Name: Age, Length: 768, dtype: int64

In [108]:
data_column = df[['Age','Insulin','BloodPressure']]
data_column

     Age  Insulin  BloodPressure
0     50        0             72
1     31        0             66
2     32        0             64
3     21       94             66
4     33      168             40
..   ...      ...            ...
763   63      180             76
764   27        0             70
765   30      112             72
766   47        0             60
767   23        0             70

[768 rows x 3 columns]

In [112]:
# Accessing a row by index
first_row = df.loc[0]
first_row

Pregnancies                   6.000
Glucose                     148.000
BloodPressure                72.000
SkinThickness                35.000
Insulin                       0.000
BMI                          33.600
DiabetesPedigreeFunction      0.627
Age                          50.000
Outcome                       1.000
Name: 0, dtype: float64

In [113]:
# Accessing an element
age_of_second = df.at[1, 'Age']
age_of_second

31

### Filtering

In [114]:
#filtering the data 
#reading datas from files  and writing to files 
import pandas as pd

df = pd.read_csv('datas/diabetes.csv')
df.tail(2)

     Pregnancies  Glucose  ...  Age  Outcome
766            1      126  ...   47        1
767            1       93  ...   23        0

[2 rows x 9 columns]

In [116]:
# Filtering
young_people = df[df['Age'] < 25]
young_people

     Pregnancies  Glucose  ...  Age  Outcome
3              1       89  ...   21        0
27             1       97  ...   22        0
32             3       88  ...   22        0
47             2       71  ...   22        0
49             7      105  ...   24        0
..           ...      ...  ...  ...      ...
738            2       99  ...   21        0
742            1      109  ...   22        0
750            4      136  ...   22        1
760            2       88  ...   22        0
767            1       93  ...   23        0

[219 rows x 9 columns]

In [118]:
# Sorting
sorted_df = df.sort_values(by='Age')
sorted_df

     Pregnancies  Glucose  ...  Age  Outcome
255            1      113  ...   21        1
60             2       84  ...   21        0
102            0      125  ...   21        0
182            1        0  ...   21        0
623            0       94  ...   21        0
..           ...      ...  ...  ...      ...
123            5      132  ...   69        0
684            5      136  ...   69        0
666            4      145  ...   70        1
453            2      119  ...   72        0
459            9      134  ...   81        0

[768 rows x 9 columns]

In [120]:
# Grouping
grouped_by_preg = df.groupby('Pregnancies').mean()
grouped_by_preg

                Glucose  BloodPressure  ...        Age   Outcome
Pregnancies                             ...
0            123.000000      67.153153  ...  27.603604  0.342342
1            112.748148      67.792593  ...  27.370370  0.214815
2            110.796117      63.252427  ...  27.194175  0.184466
3            123.586667      66.586667  ...  29.026667  0.360000
4            125.117647      70.029412  ...  32.779412  0.338235
5            118.859649      76.210526  ...  39.035088  0.368421
6            120.800000      68.420000  ...  39.340000  0.320000
7            136.444444      70.777778  ...  41.111111  0.555556
8            131.736842      75.184211  ...  45.368421  0.578947
9            131.392857      77.892857  ...  44.178571  0.642857
10           120.916667      70.208333  ...  42.666667  0.416667
11           126.454545      74.181818  ...  44.545455  0.636364
12           113.555556      76.333333  ...  47.444444  0.444444
13           125.500000      73.800000  ...  44.500000  0.500000
14           137.500000      70.000000  ...  42.000000  1.000000
15           136.000000      70.000000  ...  43.000000  1.000000
17           163.000000      72.000000  ...  47.000000  1.000000

[17 rows x 8 columns]

In [122]:
# Grouping
grouped_by_preg = df.groupby('Age').mean()
grouped_by_preg

     Pregnancies     Glucose  ...  DiabetesPedigreeFunction   Outcome
Age                           ...
21      1.079365  108.317460  ...                  0.433825  0.079365
22      1.555556  108.208333  ...                  0.430625  0.152778
23      1.578947  111.578947  ...                  0.438579  0.184211
24      1.891304  117.891304  ...                  0.393565  0.173913
25      1.770833  110.083333  ...                  0.600500  0.291667
26      1.969697  118.212121  ...                  0.413455  0.242424
27      2.562500  115.281250  ...                  0.471750  0.250000
28      3.028571  119.914286  ...                  0.459629  0.285714
29      3.310345  127.379310  ...                  0.408897  0.448276
30      3.619048  122.285714  ...                  0.367238  0.285714
31      3.875000  126.958333  ...                  0.589583  0.541667
32      4.437500  116.312500  ...                  0.613250  0.562500
33      4.058824  122.882353  ...                  0.734176  0.588235
34      5.857143  131.857143  ...                  0.649857  0.285714
35      5.000000  121.400000  ...                  0.454000  0.500000
36      5.187500  132.437500  ...                  0.472875  0.625000
37      5.263158  130.157895  ...                  0.414632  0.315789
38      6.875000  121.125000  ...                  0.413938  0.625000
39      7.416667  126.750000  ...                  0.605917  0.250000
40      6.230769  130.923077  ...                  0.376077  0.461538
41      6.500000  129.090909  ...                  0.396273  0.590909
42      6.888889  109.555556  ...                  0.388000  0.388889
43      7.769231  133.000000  ...                  0.450846  0.846154
44      7.250000  124.375000  ...                  0.668375  0.625000
45      7.333333  131.200000  ...                  0.496467  0.533333
46      6.384615  105.923077  ...                  0.426846  0.538462
47      8.333333  137.000000  ...                  0.355333  0.666667
48      8.800000  107.600000  ...                  0.456800  0.200000
49      7.600000  153.000000  ...                  0.612000  0.600000
50      6.750000  138.250000  ...                  0.470125  0.625000
51      8.625000  147.625000  ...                  0.615250  0.625000
52      4.625000  133.000000  ...                  0.505375  0.875000
53      5.400000  158.000000  ...                  0.550600  0.800000
54      7.000000  140.333333  ...                  0.465500  0.666667
55      5.500000  140.750000  ...                  0.226500  0.250000
56      8.000000   98.333333  ...                  0.936667  0.666667
57      8.800000  137.800000  ...                  0.704000  0.200000
58      7.142857  135.142857  ...                  0.554714  0.428571
59      2.333333  173.333333  ...                  0.252667  0.666667
60      6.000000  146.400000  ...                  0.436800  0.400000
61      5.500000  144.000000  ...                  0.613000  0.500000
62      3.750000  139.500000  ...                  0.565500  0.500000
63      5.500000  133.250000  ...                  0.249250  0.000000
64      8.000000  120.000000  ...                  0.409000  0.000000
65      3.333333  137.000000  ...                  0.259000  0.000000
66      5.000000  157.000000  ...                  0.408500  0.500000
67      4.000000  132.333333  ...                  0.602000  0.333333
68      8.000000   91.000000  ...                  0.587000  0.000000
69      5.000000  134.000000  ...                  0.413000  0.000000
70      4.000000  145.000000  ...                  0.235000  1.000000
72      2.000000  119.000000  ...                  0.832000  0.000000
81      9.000000  134.000000  ...                  0.460000  0.000000

[52 rows x 8 columns]

In [127]:
import pandas as pd

data = pd.DataFrame({"name": ["govind", "kavitha"], "age": [34, 32]})
print("Data:")
print(data)

other_data = pd.DataFrame({'City': ['New York', 'San Francisco'], 'Population': [8500000, 884000]})
other_data.index = [0, 1]  # Set the index for other_data to match the index in data

# Merge based on index
merged_df = pd.merge(data, other_data, left_index=True, right_index=True)

print("\nMerged DataFrame:")
print(merged_df)

Data:
      name  age
0   govind   34
1  kavitha   32

Merged DataFrame:
      name  age           City  Population
0   govind   34       New York     8500000
1  kavitha   32  San Francisco      884000

In [128]:
merged_df

      name  age           City  Population
0   govind   34       New York     8500000
1  kavitha   32  San Francisco      884000

In [129]:
# Drop rows with missing values
df_no_na = df.dropna()
df_no_na

     Pregnancies  Glucose  ...  Age  Outcome
0              6      148  ...   50        1
1              1       85  ...   31        0
2              8      183  ...   32        1
3              1       89  ...   21        0
4              0      137  ...   33        1
..           ...      ...  ...  ...      ...
763           10      101  ...   63        0
764            2      122  ...   27        0
765            5      121  ...   30        0
766            1      126  ...   47        1
767            1       93  ...   23        0

[768 rows x 9 columns]

In [131]:

# Fill missing values with a specific value
df_filled = df.fillna(value=0)
df_filled

     Pregnancies  Glucose  ...  Age  Outcome
0              6      148  ...   50        1
1              1       85  ...   31        0
2              8      183  ...   32        1
3              1       89  ...   21        0
4              0      137  ...   33        1
..           ...      ...  ...  ...      ...
763           10      101  ...   63        0
764            2      122  ...   27        0
765            5      121  ...   30        0
766            1      126  ...   47        1
767            1       93  ...   23        0

[768 rows x 9 columns]